# StairsDbgShowLeftRunBoundary3d Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsDbgShowLeftRunBoundary3d Property
ParameterTypeId Class See Also
---
"Show Run's Left Boundary 3D"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsDbgShowLeftRunBoundary3d { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsDbgShowLeftRunBoundary3d As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsDbgShowLeftRunBoundary3d {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace